#include <stdio.h>

/**
 _   _          _   _         _______ _       _ _______  _______  _______  _______  _______  _______  _______  _______ 
(_) | |        (_) | |       / _____ \\\     /// _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \
| | | |        | | | |       |/     \| \\   // |/     \||/     \||/     \||/     \||/     \||/     \||/     \||/     \|
| | | |        | | | |______ ||     ||  \\ //  ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |        | | | |_____ \||     ||   ||    ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |        | | | |     \|||     ||  //\\   ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |_______ | | | |____ /||\_____/| //  \\  |\_____/||\_____/||\_____/||\_____/||\_____/||\_____/||\_____/||\_____/|
|_| |_________||_| |_|______/\_______///    \\ \_______/\_______/\_______/\_______/\_______/\_______/\_______/\_______/
 *
 *
 * @author  ilib0x00000000
 * @email   yinghaozhg@qq.com
 * @version 0.1
 *
 * 一个袋子里面有n个球，每个球上面都有一个号码(拥有相同号码的球是无区别的)。如果一个袋子是幸运的当且仅当所有球的号码的和大于所有球的号码的积。
 * 例如：如果袋子里面的球的号码是{1, 1, 2, 3}，这个袋子就是幸运的，因为1 + 1 + 2 + 3 > 1 * 1 * 2 * 3
 * 你可以适当从袋子里移除一些球(可以移除0个,但是别移除完)，要使移除后的袋子是幸运的。现在让你编程计算一下你可以获得的多少种不同的幸运的袋子。
 *
 * 待解决：重复没有情况没有排除
*/

int desolution(int arr[], int length)
{
	/**
	 * a0 a1 a2 a3 a4 a5 a6 a7 a8 a9 ...
	 * 解题思路：
	 * 	如果a0+a1幸运， 测试a0+a1+a2， 如果继续幸运，测试a0+a1+a2+a3，直到不幸运或者遍历完数组
	 * 	   a0+a2幸运，  a0+a2+a3....
	 * 	   .
	 * 	   .
	 * 	   .
	 * 	a1+a2...
	 * 	a1+a3...
	 * 	   .
	 * 	   .
	 * 	   .
	 * 	a(length-2)+a(length-1)
	 */
	int i;
	int j;
	int k;
	int sum;    // 和值
	int multi;  // 积值
	int total = 0;

	for(i = 0; i < length-1; i++)
	{
		for(j = i+1; j < length; j++)
		{
			k = j+1;
			sum = arr[i] + arr[j];
			multi = arr[i] * arr[j];

			// 只要和值大于积值，就不断的测试下一个数字
			while(sum > multi)
			{
				total += 1;

				if(k < length)
				{
					sum += arr[k];
					multi *= arr[k];
					k++;
				}
				else
					break;
			}
		}
	}

	return total;
}



int main(int argc, char const *argv[])
{
	int arr[] = {1, 1, 1};

	printf("%d\n", desolution(arr, 3));

	return 0;
}
