#include <stdio.h>

/**

 _   _          _   _         _______ _       _ _______  _______  _______  _______  _______  _______  _______  _______ 
(_) | |        (_) | |       / _____ \\\     /// _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \
| | | |        | | | |       |/     \| \\   // |/     \||/     \||/     \||/     \||/     \||/     \||/     \||/     \|
| | | |        | | | |______ ||     ||  \\ //  ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |        | | | |_____ \||     ||   ||    ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |        | | | |     \|||     ||  //\\   ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |_______ | | | |____ /||\_____/| //  \\  |\_____/||\_____/||\_____/||\_____/||\_____/||\_____/||\_____/||\_____/|
|_| |_________||_| |_|______/\_______///    \\ \_______/\_______/\_______/\_______/\_______/\_______/\_______/\_______/
 *
 *
 * @author  ilib0x00000000
 * @email   yinghaozhg@qq.com
 * @version 0.1
 *
 * 动态规划----最长非降子序列长度
*/

int maxlength(int arr[], int length)
{
	/**
	 * 解题思路：假设有一个数表示当前非降序列的长度，若下一个数大于当前的数，则非降序列的长度加1，否则比较当前的非降序列长度与最大长度，且将当前非降序列长度重置为1
	 */
	int i;
	int max = 0;
	int temp = 1;

	for(i = 1; i < length; i++)
	{
		if(arr[i] >= arr[i-1])
		{
			temp += 1;    // 如果当前下标对应的数大于前一个数，则当前非降序列长度加1
		}else
		{
			if(temp > max)
			{
				max = temp;  // 当前下标对应的数小于前一个数，比较之前出现的最大非降序列长度，将新的最大值赋值给max
			}
			temp = 1;       // 将非降序列长度重置为1
		}
	}

	return max;
}


int main(int argc, char const *argv[])
{
	int arr[] = { 5, 3, 4, 8, 6, 7 };
	int max;

	max = maxlength(arr, 6);

	printf("%d\n", max);

	return 0;
}