#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#include<unistd.h>
#include<sys/types.h>

/*
 _   _          _   _         _______ _       _ _______  _______  _______  _______  _______  _______  _______  _______ 
(_) | |        (_) | |       / _____ \\\     /// _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \/ _____ \
| | | |        | | | |       |/     \| \\   // |/     \||/     \||/     \||/     \||/     \||/     \||/     \||/     \|
| | | |        | | | |______ ||     ||  \\ //  ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |        | | | |_____ \||     ||   ||    ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |        | | | |     \|||     ||  //\\   ||     ||||     ||||     ||||     ||||     ||||     ||||     ||||     ||
| | | |_______ | | | |____ /||\_____/| //  \\  |\_____/||\_____/||\_____/||\_____/||\_____/||\_____/||\_____/||\_____/|
|_| |_________||_| |_|______/\_______///    \\ \_______/\_______/\_______/\_______/\_______/\_______/\_______/\_______/

*************************************************************************************
 @Email   ilib0x00000000@gmail.com
 @date    2016-06-07 22:13:14
 @version 0.1
*************************************************************************************
*/

/**
 * Linux系统的主要功能
 * 1.存储管理
 * 			Linux采取页面式存储管理机制，在Linux中每一个进程都有一个比实际物理空间大得多的进程虚拟空间，每个进程还保留
 * 			一张页表，用于将本进程空间中的虚拟地址变换成物理地址。
 * 2.进程管理
 * 			Linux创建进程的方法采用的是copy in write，不复制父进程的空间，只复制父进程的页表，使父进程和子进程共享物理
 * 			空间，并将这个共享空间设置为只读
 * 3.文件系统
 * 			虚拟文件系统
 * 4.进程间通信
 * 			Linux的通信机制：管道、信号、消息队列、信号灯以及共享内存
 * 			不同机器之间的进程通信：socket机制
 */


int main(int argc, char const *argv[])
{
	pid_t pid;

	/**
	 * fork执行两次返回
	 * 在父进程中返回的是子进程的pid
	 * 在子进程中返回的是0
	 * 出错时返回为-1
	 */

	pid = fork();

	if(pid < 0)
	{
		printf("fork error\n");
		exit(1);
	}else
	if (pid == 0)
	{
		/*当前执行的代码是子进程的代码*/
		printf("Child process is printing\n");
	}else
	{
		printf("Parent process is printing\n");
		printf("Child pid %d\n", pid);
	}

	return 0;
}
